[
  {
    "id": 1,
    "section": "354",
    "title": "Assault or Criminal Force to Woman with Intent to Outrage her Modesty",
    "description": "Whoever assaults or uses criminal force to any woman, intending to outrage or knowing it to be likely that he will thereby outrage her modesty, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "id": 2,
    "section": "354A",
    "title": "Sexual Harassment",
    "description": "A man committing any of the following acts: physical contact and advances involving unwelcome and explicit sexual overtures, or a demand or request for sexual favours, or showing pornography against the will of a woman, or making sexually coloured remarks, shall be guilty of the offence of sexual harassment."
  },
  {
    "id": 3,
    "section": "354B",
    "title": "Assault or Use of Criminal Force to Woman with Intent to Disrobe",
    "description": "Any man who assaults or uses criminal force to any woman or abets such act with the intention of disrobing or compelling her to be naked, shall be punished with imprisonment of either description for a term which shall not be less than three years but which may extend to seven years, and shall also be liable to fine."
  },
  {
    "id": 4,
    "section": "354C",
    "title": "Voyeurism",
    "description": "Any man who watches, or captures the image of a woman engaging in a private act in circumstances where she would usually have the expectation of not being observed either by the perpetrator or by any other person at the behest of the perpetrator or disseminates such image shall be punished on first conviction with imprisonment of either description for a term which shall not be less than one year, but which may extend to three years, and shall also be liable to fine."
  },
  {
    "id": 5,
    "section": "354D",
    "title": "Stalking",
    "description": "Any man who follows a woman and contacts, or attempts to contact such woman to foster personal interaction repeatedly despite a clear indication of disinterest by such woman, or monitors the use by a woman of the internet, email or any other form of electronic communication, commits the offence of stalking."
  },
  {
    "id": 6,
    "section": "375",
    "title": "Rape",
    "description": "A man is said to commit rape if he penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a woman or makes her to do so with him or any other person; or inserts, to any extent, any object or a part of the body, not being the penis, into the vagina, the urethra or anus of a woman or makes her to do so with him or any other person."
  },
  {
    "id": 7,
    "section": "498A",
    "title": "Husband or Relative of Husband Subjecting a Woman to Cruelty",
    "description": "Whoever, being the husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine."
  },
  {
    "id": 8,
    "section": "509",
    "title": "Word, Gesture or Act Intended to Insult the Modesty of a Woman",
    "description": "Whoever, intending to insult the modesty of any woman, utters any word, makes any sound or gesture, or exhibits any object, intending that such word or sound shall be heard, or that such gesture or object shall be seen, by such woman, or intrudes upon the privacy of such woman, shall be punished with simple imprisonment for a term which may extend to three years, and also with fine."
  }
]